<h2> Notebook overview </h2>

- In this notebook, I wrangle sales data (excel file) for the ecommerce company VS Electronics
- The data was downloaded from here: https://docs.google.com/spreadsheets/d/1ibqfNymNhp8hmfVz7SOO3L7Iv_ADQzjj/edit?usp=sharing&ouid=112478853022456914671&rtpof=true&sd=true
- There are five tables, in the form of five excel sheets. 
- I create a separate dataframe for each table
- I clean and prepare the data so each dataframe can be exported to a postgreSQL database
- The data includes all sales data for the years 2018 and 2019

In [1]:
import numpy as np 
import pandas as pd 
import json
from sqlalchemy import create_engine
import psycopg2

<h3> 1) Load Excel file as dataframes </h3>

In [3]:
invoices = pd.read_excel('sales_original.xlsx', sheet_name = 'invoices')
assessment = pd.read_excel('sales_original.xlsx', sheet_name = 'assessment')
customers = pd.read_excel('sales_original.xlsx', sheet_name = 'customers')
products = pd.read_excel('sales_original.xlsx', sheet_name = 'products')
stock = pd.read_excel('sales_original.xlsx', sheet_name = 'stock')

- run time: 58 s

<h3> 2) Clean the data </h3>

- We'll go one dataframe at a time.

<h4> 2.1) Cleaning the "products" dataframe </h4>

In [4]:
products.head()

         ASIN                                              title product_type
0  B07GWKDLGT  Nikon D3500 W/ AF-P DX NIKKOR 18-55mm f/3.5-5....  dslr camera
1  B01MTLH408  Manfrotto Element Aluminum 5-Section Monopod, ...  dslr camera
2  B0064FS7HI  STK LP-E8 Battery for Canon Rebel T5i, T3i, T2...  dslr camera
3  B013JHU5YG  Lowepro Whistler BP 350 AW (Grey) . Profession...  dslr camera
4  B06XWN9Q99  Samsung (MB-ME32GA/AM) 32GB 95MB/s (U1) microS...  dslr camera

- Check for duplicate rows

In [5]:
products.duplicated().sum()

550043

- That's a lot of duplicate rows. Let's drop them.

In [6]:
products_mod = products.drop_duplicates()

In [7]:
products_mod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4374 entries, 0 to 554388
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ASIN          4374 non-null   object
 1   title         4374 non-null   object
 2   product_type  4374 non-null   object
dtypes: object(3)
memory usage: 136.7+ KB

- We went from over 500k rows to around 4k rows

In [8]:
products_mod.nunique()

ASIN            4134
title           4188
product_type       6
dtype: int64

In [9]:
products_mod.head()

         ASIN                                              title product_type
0  B07GWKDLGT  Nikon D3500 W/ AF-P DX NIKKOR 18-55mm f/3.5-5....  dslr camera
1  B01MTLH408  Manfrotto Element Aluminum 5-Section Monopod, ...  dslr camera
2  B0064FS7HI  STK LP-E8 Battery for Canon Rebel T5i, T3i, T2...  dslr camera
3  B013JHU5YG  Lowepro Whistler BP 350 AW (Grey) . Profession...  dslr camera
4  B06XWN9Q99  Samsung (MB-ME32GA/AM) 32GB 95MB/s (U1) microS...  dslr camera

- I want to check for nan values in the ASIN column, but the data type is "object".
- But scanning the excel table, I see that every ASIN value either begins with a "B" or is "Null" (string format). 
- Use that to locate the nan values.

In [10]:
counter_null = 0
counter_not_null = 0
for row in products_mod['ASIN']:    # fetch all values in "ASIN" column
    if 'B' not in row:
        if row == 'Null':
            counter_null += 1
        elif row != 'Null':
            counter_not_null +=1
print (counter_null, counter_not_null)

64 0

- This confirms that all values that don't begin with a "B" are "Null", and there are 64 of them.

In [11]:
# Check rows where ASIN value == "Null"
products_mod.loc[products_mod['ASIN'] == 'Null']

        ASIN                                              title product_type
527     Null  Perixx Perimice-718R Wireless 2.4 GHz Ergonomi...     keyboard
528     Null  Belkin B2B191 Wired Tablet Keyboard with Stand...     keyboard
529     Null  Rechargeable Wireless Keyboard Mouse, Jelly Co...     keyboard
530     Null  Wireless Keyboard Mouse Combo, Cimetech Compac...     keyboard
531     Null  Macally Wireless Keyboard and Mouse Combo Bund...     keyboard
...      ...                                                ...          ...
193248  Null  Eyoyo S801C 8 Inch Small HDMI BNC VGA Monitor ...      monitor
230878  Null  Wireless Keyboard Mouse Combo, Cimetech Compac...     keyboard
290841  Null  Corsair K95 RGB Platinum XT Mechanical Gaming ...     keyboard
340434  Null  X3 Hurricane Variable Speed 260mph+ Cordless R...     keyboard
410319  Null  2.4GHz Wireless Bluetooth Mouse, 3 Adjustable ...        mouse

[64 rows x 3 columns]

- The 'ASIN' code is the primary key in all tables (and it is the column we will use to join). 
- As such, the 'Null' ASIN codes are unusable and can be dropped.

In [12]:
products_mod = products_mod [products_mod['ASIN']!= 'Null']

- Compare number of unique ASIN codes vs number of unique product titles

In [233]:
# Unique 'ASIN' codes vs unique 'title'
products_mod['ASIN'].nunique(), products_mod['title'].nunique()

(4133, 4131)

- There are more unique 'ASIN' codes than there are unique product titles. Why is that?

In [13]:
temp = products_mod.groupby(['ASIN', 'product_type']).count().sort_values('title', ascending = False)
temp

                         title
ASIN       product_type
B00000JRRD mouse             1
B07MMMV4V4 keyboard          1
B07MG3GDFS keyboard          1
B07MG85X1M monitor           1
B07MGGD6JD keyboard          1
...                        ...
B01N5O0DDC keyboard          1
           mouse             1
B01N63FKT1 mouse             1
B01N6ETMVT processor         1
B08CKK9FLS processor         1

[4310 rows x 1 columns]

- Ok, good to know. Every pair of (ASIN, product_type) only has a single title. 
- So even if a single ASIN code has multiple titles, all titles (and thus the ASIN code) refer to the same product.

In [14]:
products_mod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4310 entries, 0 to 554388
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ASIN          4310 non-null   object
 1   title         4310 non-null   object
 2   product_type  4310 non-null   object
dtypes: object(3)
memory usage: 134.7+ KB

- Finally, relabel the columns so they are all lower case (to make SQL happy)
- Also relabel "ASIN" as "product_id", and "title" as "product_name".

In [15]:
products_mod.rename(columns = {'ASIN':'product_id', 'title':'product_name'}, inplace = True)

In [16]:
products_mod.head(2)

   product_id                                       product_name product_type
0  B07GWKDLGT  Nikon D3500 W/ AF-P DX NIKKOR 18-55mm f/3.5-5....  dslr camera
1  B01MTLH408  Manfrotto Element Aluminum 5-Section Monopod, ...  dslr camera

<h4> Keep in mind for later: </h4>

- There are duplicate "product_id" codes in the "products" table. 
- This is because some items are classed under two different product types. 
- For example, an item that is a combination of mouse + keyboard will have a single product_id but be listed under both "mouse" and "keyboard" for "product_type".

<h4> 2.2) Cleaning the "assessment" table </h4>

In [17]:
assessment.duplicated().sum()

550131

- OK, the majority of the rows are duplicates. Drop them.

In [18]:
assessment_mod = assessment.drop_duplicates()

In [19]:
assessment_mod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4286 entries, 0 to 554388
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rating        4286 non-null   float64
 1   review_count  4286 non-null   int64
 2   ASIN          4286 non-null   object
dtypes: float64(1), int64(1), object(1)
memory usage: 133.9+ KB

- Good. Reduced from ~554k rows to ~4k rows

- Drop rows where the ASIN code is "Null"

In [21]:
# Drop rows where ASIN code is null
assessment_mod = assessment_mod[assessment_mod['ASIN'] != 'Null']

In [22]:
assessment_mod.nunique()

rating            26
review_count    1372
ASIN            4133
dtype: int64

- There are 4133 unique ASIN codes

In [23]:
assessment_mod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4232 entries, 0 to 554388
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rating        4232 non-null   float64
 1   review_count  4232 non-null   int64
 2   ASIN          4232 non-null   object
dtypes: float64(1), int64(1), object(1)
memory usage: 132.2+ KB

- The total number of 'ASIN' codes is slightly higher than the number of unique 'ASIN' codes.
- In other words, there are duplicate 'ASIN' codes in the assessment_mod table. Why?

In [24]:
dummy = assessment_mod.groupby('ASIN').count().reset_index()
dummy2 = dummy [dummy['rating'] > 1]
dummy2

            ASIN  rating  review_count
16    B00006B8IU       2             2
111   B001A1UX0U       2             2
261   B004TLJUWU       2             2
276   B0058OU8VY       2             2
283   B005EJH6Z4       2             2
...          ...     ...           ...
4005  B083TWG15D       2             2
4056  B085NTW9NK       2             2
4072  B086226DDB       2             2
4086  B086T12YGJ       2             2
4129  B089F7MP6K       2             2

[99 rows x 3 columns]

- There are 99 'ASIN' codes that each have two rows. 
- Let's check a couple of them

In [25]:
assessment_mod [assessment_mod['ASIN'] == 'B00006B8IU']

      rating  review_count        ASIN
921      4.6          1717  B00006B8IU
1738     4.6          1719  B00006B8IU

In [26]:
assessment_mod [assessment_mod['ASIN'] == 'B001A1UX0U']

      rating  review_count        ASIN
920      4.3          1519  B001A1UX0U
1737     4.3          1520  B001A1UX0U

- It appears that the duplicated rows hold very similar values. Possibly a data entry error. 
- Since the values in the duplicate rows are so similar, just group by "ASIN" code and find mean.

In [27]:
assessment_mod = assessment_mod.groupby('ASIN').mean().reset_index()

In [28]:
assessment_mod.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4133 entries, 0 to 4132
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ASIN          4133 non-null   object
 1   rating        4133 non-null   float64
 2   review_count  4133 non-null   float64
dtypes: float64(2), object(1)
memory usage: 97.0+ KB

In [29]:
assessment_mod.nunique()

ASIN            4133
rating            32
review_count    1381
dtype: int64

- Good, now all rows have a unique "ASIN" code.
- Also, the number of unique "ASIN" codes in assessment_mod is the same as in products_mod

- Rename the "ASIN" column as "product_id"

In [30]:
assessment_mod.rename(columns = {'ASIN':'product_id'}, inplace = True)

<h4> 2.3) Cleaning "invoices" dataframe </h4>

In [32]:
invoices.head()

,InvoiceNo,ASIN,Quantity,price,total_sale,invoice_date,invoice_time,CustomerID
0,78536597,B07GWKDLGT,4,496.95,1987.80,2018-12-01,17,18011
1,78536597,B01MTLH408,4,39.99,159.96,2018-12-01,17,18011
2,78536597,B0064FS7HI,1,12.99,12.99,2018-12-01,17,18011
3,78536597,B013JHU5YG,1,199.99,199.99,2018-12-01,17,18011
4,78536597,B06XWN9Q99,1,7.49,7.49,2018-12-01,17,18011

In [33]:
invoices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 554417 entries, 0 to 554416
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   InvoiceNo     554417 non-null  object
 1   ASIN          554417 non-null  object
 2   Quantity      554417 non-null  int64
 3   price         554417 non-null  float64
 4   total_sale    554417 non-null  float64
 5   invoice_date  554417 non-null  datetime64[ns]
 6   invoice_time  554417 non-null  int64
 7   CustomerID    554417 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(2), object(3)
memory usage: 33.8+ MB

In [34]:
invoices.duplicated().sum()

26233

- Drop duplicate rows and rows were "ASIN" value is "Null"

In [35]:
invoices_mod = invoices.drop_duplicates()
invoices_mod = invoices_mod[invoices_mod['ASIN'] != 'Null']

In [36]:
invoices_mod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 519896 entries, 0 to 554416
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   InvoiceNo     519896 non-null  object
 1   ASIN          519896 non-null  object
 2   Quantity      519896 non-null  int64
 3   price         519896 non-null  float64
 4   total_sale    519896 non-null  float64
 5   invoice_date  519896 non-null  datetime64[ns]
 6   invoice_time  519896 non-null  int64
 7   CustomerID    519896 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(2), object(3)
memory usage: 35.7+ MB

- After dropping duplicate rows, still have ~520k rows

In [37]:
invoices_mod.nunique()

InvoiceNo       20517
ASIN             4133
Quantity          453
price            1357
total_sale      16850
invoice_date      305
invoice_time       15
CustomerID       4340
dtype: int64

- Good. The number of unique "ASIN" codes is the same as in products_mod and assessment_mod
- This also means there are no null values among the "ASIN" codes <br>
- We can go ahead and keep all the rows at this point.

- Rename the columns

In [38]:
invoices_mod.rename(columns = {'InvoiceNo': 'invoice_no', 'ASIN':'product_id', 'Quantity': 'quantity', 'price':'unit_price', 'CustomerID': 'customer_id'}, inplace=True)

- Combine "invoice_date" and "invoice_time" columns into single datetime column

In [39]:
invoices_mod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 519896 entries, 0 to 554416
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   invoice_no    519896 non-null  object
 1   product_id    519896 non-null  object
 2   quantity      519896 non-null  int64
 3   unit_price    519896 non-null  float64
 4   total_sale    519896 non-null  float64
 5   invoice_date  519896 non-null  datetime64[ns]
 6   invoice_time  519896 non-null  int64
 7   customer_id   519896 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(2), object(3)
memory usage: 35.7+ MB

In [40]:
# invoice_date is already in datetime format, but invoice_time is type int64, which needs to be cast as datetime.
invoices_mod['invoice_datetime'] = invoices_mod['invoice_date'] + invoices_mod['invoice_time'].astype('timedelta64[h]')

In [41]:
# Can now drop "invoice_date" and "invoice_time"
invoices_mod.drop(['invoice_date', 'invoice_time'], axis = 1, inplace=True)

In [42]:
invoices_mod.head(2)

,invoice_no,product_id,quantity,unit_price,total_sale,customer_id,invoice_datetime
0,78536597,B07GWKDLGT,4,496.95,1987.80,18011,2018-12-01 17:00:00
1,78536597,B01MTLH408,4,39.99,159.96,18011,2018-12-01 17:00:00

- Et voila.

<h4> 2.4) Cleaning "customers" dataframe </h4>

In [43]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 554417 entries, 0 to 554416
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   CustomerID  554417 non-null  object
 1   Country     554417 non-null  object
dtypes: object(2)
memory usage: 8.5+ MB

In [44]:
customers.head()

  CustomerID  Country
0      18011  Germany
1      18011  Germany
2      18011  Germany
3      18011  Germany
4      18011  Germany

- Lots of duplicates suspected.

In [45]:
customers.duplicated().sum()

550061

- The "CustomerID" is the primary key of this table, so drop all duplicate CustomerIDs.
- Also drop all null values in CustomerID column.

In [46]:
customers_mod = customers.drop_duplicates(subset = 'CustomerID')
customers_mod = customers_mod[customers_mod['CustomerID']!= 'Null']

In [47]:
customers_mod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4339 entries, 0 to 552748
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  4339 non-null   object
 1   Country     4339 non-null   object
dtypes: object(2)
memory usage: 101.7+ KB

In [48]:
customers_mod.nunique()

CustomerID    4339
Country         36
dtype: int64

- Rename columns

In [49]:
customers_mod.rename(columns = {'CustomerID':'customer_id', 'Country':'country'}, inplace = True)

<h4> 2.5) Clean "stock" dataframe </h4>

In [50]:
stock.head()

  StockCode        ASIN
0     21703  B07GWKDLGT
1     40001  B01MTLH408
2    85034A  B0064FS7HI
3    72798C  B013JHU5YG
4     20726  B06XWN9Q99

In [51]:
stock.duplicated().sum()

549635

In [52]:
stock_mod = stock.drop_duplicates()

In [53]:
stock_mod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4782 entries, 0 to 554388
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StockCode  4782 non-null   object
 1   ASIN       4782 non-null   object
dtypes: object(2)
memory usage: 112.1+ KB

In [54]:
stock_mod = stock_mod.rename(columns = {'StockCode':'stock_code', 'ASIN':'product_id'})

In [55]:
stock_mod.nunique()

stock_code    3942
product_id    4134
dtype: int64

- Alright. So sometimes a stock_code has more than one product_id.
- The stock table is likely the one we will use least (if at all). Leave as is for now.

<h3> 3) Explort cleaned dataframes as tables to database in PGadmin </h3>

- Use sql engine to export dataframes as SQL tables to PGadmin
- Documentation for sqlEngine: https://docs.sqlalchemy.org/en/14/core/engines.html

<h4> Summary of syntax for sql engine </h4>

- dialect+driver://username:password@host:port/database
- Go to pgAdmin, right-click on the server (in my case CAB) to get the connection info.
- For this project:
- hostname: localhost
- port: 5432
- Username: postgres
- Password: 1234
- database: ecommerce2    
- (Need to create database first before exporting tables to pgAdmin using engine)
- Dialect names include the identifying name of the SQLAlchemy dialect, a name such as sqlite, mysql, postgresql, oracle, or mssql. T
- The drivername is the name of the DBAPI to be used to connect to the database using all lowercase letters. 
- "The PostgreSQL dialect uses psycopg2 as the default DBAPI."

In [284]:
tableNames = ['invoices', 'assessment', 'customers', 'products', 'stock']
dataframes = [invoices_mod, assessment_mod, customers_mod, products_mod, stock_mod]

for tableName, dataframe in zip (tableNames, dataframes): 

    sqlEngine = create_engine('postgresql+psycopg2://postgres:1234@localhost:5432/ecommerce2', pool_recycle=3600)       

    try:
        dataframe.to_sql(tableName, sqlEngine, if_exists='replace',index = False)

    except ValueError as vx:
        print(vx)

    except Exception as ex:   
        print(ex)

    else:
        print("Table %s created successfully."%tableName);   

    finally:
        sqlEngine.dispose()

Table invoices created successfully.
Table assessment created successfully.
Table customers created successfully.
Table products created successfully.